; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=73, remove_proportion=0.101, bases=29, instance_id=22, output=./training, seed=63

(define (problem warehouse-22)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 box59 box60 box61 box62 box63 box64 box65 box66 box67 box68 box69 box70 box71 box72 box73 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 base24 base25 base26 base27 base28 base29 - base
    )
    (:init
        (to-remove box12)
        (to-remove box33)
        (to-remove box38)
        (to-remove box50)
        (to-remove box57)
        (to-remove box62)
        (to-remove box73)
        (clear box52)
        (on box52 box56)
        (on box56 box25)
        (on-base box25 base1)
        (clear box14)
        (on box14 box63)
        (on box63 box45)
        (on box45 box46)
        (on box46 box65)
        (on box65 box26)
        (on box26 box61)
        (on-base box61 base2)
        (clear box68)
        (on box68 box2)
        (on box2 box7)
        (on box7 box3)
        (on-base box3 base3)
        (clear box43)
        (on box43 box51)
        (on-base box51 base4)
        (clear box19)
        (on-base box19 base5)
        (clear box54)
        (on box54 box31)
        (on-base box31 base6)
        (clear box5)
        (on box5 box42)
        (on-base box42 base7)
        (clear box32)
        (on box32 box15)
        (on box15 box21)
        (on-base box21 base8)
        (clear box22)
        (on box22 box69)
        (on-base box69 base9)
        (clear box6)
        (on box6 box10)
        (on-base box10 base10)
        (clear box49)
        (on box49 box47)
        (on box47 box20)
        (on-base box20 base11)
        (clear box64)
        (on box64 box39)
        (on box39 box66)
        (on box66 box62)
        (on-base box62 base12)
        (clear box58)
        (on-base box58 base13)
        (clear box67)
        (on box67 box37)
        (on box37 box36)
        (on-base box36 base14)
        (clear box60)
        (on-base box60 base15)
        (clear box40)
        (on-base box40 base16)
        (clear-base base17)
        (clear box73)
        (on box73 box71)
        (on box71 box35)
        (on-base box35 base18)
        (clear box53)
        (on-base box53 base19)
        (clear box29)
        (on box29 box34)
        (on box34 box55)
        (on box55 box48)
        (on box48 box13)
        (on box13 box23)
        (on-base box23 base20)
        (clear box9)
        (on box9 box38)
        (on-base box38 base21)
        (clear box4)
        (on box4 box16)
        (on box16 box72)
        (on box72 box24)
        (on-base box24 base22)
        (clear box41)
        (on box41 box30)
        (on-base box30 base23)
        (clear box1)
        (on box1 box12)
        (on box12 box70)
        (on-base box70 base24)
        (clear box50)
        (on box50 box33)
        (on-base box33 base25)
        (clear-base base26)
        (clear box11)
        (on box11 box8)
        (on-base box8 base27)
        (clear box18)
        (on box18 box17)
        (on box17 box59)
        (on box59 box57)
        (on-base box57 base28)
        (clear box27)
        (on box27 box28)
        (on box28 box44)
        (on-base box44 base29)
    )
    (:goal (and 
        (removed box12)
        (removed box33)
        (removed box38)
        (removed box50)
        (removed box57)
        (removed box62)
        (removed box73)
    ))
)

; plan
1. (move box1 box12 box11)
   deleted: (clear box11) (on box1 box12)
   added: (on box1 box11) (clear box12)
   goals met: 0 of 7
2. (move box18 box17 box1)
   deleted: (clear box1) (on box18 box17)
   added: (on box18 box1) (clear box17)
   goals met: 0 of 7
3. (remove box12 box70)
   deleted: (on box12 box70) (clear box12)
   added: (removed box12) (clear box70)
   goals met: 1 of 7
4. (move box17 box59 box14)
   deleted: (clear box14) (on box17 box59)
   added: (on box17 box14) (clear box59)
   goals met: 1 of 7
5. (move box59 box57 box17)
   deleted: (clear box17) (on box59 box57)
   added: (on box59 box17) (clear box57)
   goals met: 1 of 7
6. (move box64 box39 box18)
   deleted: (clear box18) (on box64 box39)
   added: (on box64 box18) (clear box39)
   goals met: 1 of 7
7. (move box39 box66 box19)
   deleted: (clear box19) (on box39 box66)
   added: (on box39 box19) (clear box66)
   goals met: 1 of 7
8. (move box66 box62 box22)
   deleted: (clear box22) (on box66 box62)
   added: (on box66 box22) (clear box62)
   goals met: 1 of 7
9. (move box9 box38 box27)
   deleted: (clear box27) (on box9 box38)
   added: (on box9 box27) (clear box38)
   goals met: 1 of 7
10. (remove-from-base box38 base21)
   deleted: (on-base box38 base21) (clear box38)
   added: (removed box38) (clear-base base21)
   goals met: 2 of 7
11. (remove box50 box33)
   deleted: (on box50 box33) (clear box50)
   added: (removed box50) (clear box33)
   goals met: 3 of 7
12. (remove-from-base box33 base25)
   deleted: (on-base box33 base25) (clear box33)
   added: (removed box33) (clear-base base25)
   goals met: 4 of 7
13. (remove-from-base box57 base28)
   deleted: (on-base box57 base28) (clear box57)
   added: (removed box57) (clear-base base28)
   goals met: 5 of 7
14. (remove-from-base box62 base12)
   deleted: (on-base box62 base12) (clear box62)
   added: (removed box62) (clear-base base12)
   goals met: 6 of 7
15. (remove box73 box71)
   deleted: (on box73 box71) (clear box73)
   added: (removed box73) (clear box71)
   goals met: 7 of 7
